{
  "name": "Пятро Глебка",
  "date": "23 чэрвеня (6 ліпеня) 1905 - 18 снежня 1969",
  "img": "glebka.png",
  "videoId": "",
  "vita": "Беларускі паэт, драматург, перакладчык, арганізатар навукі. Акадэмік АН Беларускай ССР (1957). Член Саюза пісьменнікаў СССР (1934).",
  "lng": "by",
  "birthPlace": "в. Вялікая Уса, цяпер Уздзенскі раён, Мінская вобласць",
  "timelineData": [
    {
      "date": "1905",
      "text": "Нарадзіўся ў сялянскай сям'і Тодара і Таццяны Глебкаў."
    },
    {
      "date": "1923",
      "text": "Скончыў сямігодку."
    },
    {
      "date": "1924 - 1927",
      "text": "Вучыўся ў Беларускім педагагічным тэхнікуме."
    },
    {
      "date": "1928 - 1930",
      "text": "Являлся секретарём редакции журнала «Узвышша». У 1927 П. Глебка пераводзіцца на літаратурна-лінгвістычнае аддзяленне БДУ, дзе атмасфера ў цэлым спрыяла інтэлектуальнаму росту і мастацкай творчасці. Скончыў ўніверсітэт ў 1930 годзе."
    },
    {
      "date": "1930 - 1934",
      "text": "Працаваў загадчыкам літаддзела ў газеце «Калгаснік Беларусі», у часопісе «Полымя рэвалюцыі»."
    },
    {
      "date": "1934 - 1936",
      "text": "Быў кансультантам па паэзіі ў СП БССР."
    },
    {
      "date": "1939 - 1945",
      "text": "Працаваў у рэдакцыях франтавых газет «За Савецкую Беларусь», «За свабодную Беларусь». Пад псеўданімам Язэп Касіла друкаваў сатырычныя творы ў газеце-плакаце «Раздавім фашысцкую гадзіну» і ў «Партызанскай дубінцы». У 1943—1945 — рэдактар выдавецтва ЦК КП(б)Б «Савецкая Беларусь», галоўны рэдактар Дзяржаўнага выдавецтва БССР у Маскве."
    },
    {
      "date": "1945 - 1952",
      "text": "Працаваў у Інстытуце літаратуры, мовы і мастацтва Акадэміі навук Беларускай ССР."
    },
    {
      "date": "1952 - 1956",
      "text": "Кіраваў сектарам лексікаграфіі. Узначальваў групу па складанні «Руска-беларускага слоўніка» (1953)."
    },
    {
      "date": "1955 - 1969",
      "text": "з 1957 года — дырэктар Інстытута мовазнаўства. У 1957—1969 гадах Глебка узначальваў інстытут мастацтвазнаўства, этнаграфіі і фальклору Акадэміі навук Беларускай ССР. У 1966—1969 гадах — акадэмік-сакратар Аддзялення грамадскіх навук Акадэміі навук Беларускай ССР. Абіраўся дэпутатам Вярхоўнага Савета Беларускай ССР у 1955—1967 гадах. Удзельнічаў у рабоце сесій Генеральнай Асамблеі ААН (1955, 1956, 1957, 1964)."
    },
    {
      "date": "1969",
      "text": "Пятро Глебка пайшоў з жыцця 18 снежня 1969 года. Пахаваны на Усходніх могілках у Мінску."
    }
  ],
  "work": [
    {
      "title": "«Выбраныя творы»",
      "date": "1952"
    },
    {
      "title": "«Збор твораў» ў 2 тамах",
      "date": "1958"
    },
    {
      "title": "«Збор твораў» у 3 тамах",
      "date": "1969 - 1971"
    },
    {
      "title": "«Збор твораў» у 4 тамах",
      "date": "1984 - 1986"
    }
  ]
}