{
  "name": "Кандрат Крапіва (сапр.: Кандрат Кандратавіч Атраховіч)",
  "date": "22 лютага(5 сакавіка) 1896 - 7 студзеня 1991",
  "img": "krapiva.jpg",
  "videoId": "BjxiKxV32_w",
  "vita": "Беларускі пісьменнік, паэт, сатырык, драматург, перакладчык, грамадскі дзеяч, літаратуразнавец. Народны пісьменнік Беларусі (1956)[3]. Герой Сацыялістычнай Працы (1975). Лаўрэат дзвюх Сталінскіх прэмій (1941, 1951) і Дзяржаўнай прэміі СССР (1971). З 1940 — член-карэспандэнт, а з 1950 — акадэмік АН БССР[3]. Доктар філалагічных навук.",
  "lng": "by",
  "birthPlace": "в. Нізок, Ігуменскі павет, Мінская губерня, Расійская імперыя",
  "timelineData": [
    {
      "date": "1896",
      "text": "Нарадзіўся ў сялянскай сям’і. Вучыўся ў царкоўнапрыходскай школе ў вёсцы Нізок, уздзенскім народным вучылішчы, 4-класным гарадскім вучылішчы ў Стоўбцах, з якога перавёўся ў такое ж вучылішча ў Койданава (цяпер г. Дзяржынск)."
    },
    {
      "date": "1913",
      "text": "Здаў экстэрнам экзамен на званне народнага настаўніка."
    },
    {
      "date": "1914",
      "text": "Атрымаў месца настаўніка ў пачатковай земскай школе ў вёсцы Мнішаны на Міншчыне. Адпрацаваў год і быў мабілізаваны ў армію для ўдзелу ў Першай сусветнай вайне."
    },
    {
      "date": "1916",
      "text": "Скончыў Гатчынскую школу прапаршчыкаў. Удзельнічаў у баях на Румынскім фронце."
    },
    {
      "date": "1918",
      "text": "Як настаўнік у лютым 1918 дэмабілізаваны. Настаўнічаў у вёсцы Каменка на Уздзеншчыне."
    },
    {
      "date": "1920 - 1923",
      "text": "Быў камандзірам у Чырвонай Арміі."
    },
    {
      "date": "1924 - 1925",
      "text": "Зноў настаўнічаў на Уздзеншчыне ў пасёлку Астравок."
    },
    {
      "date": "1925 - 1926",
      "text": "У 1925 пераехаў у Мінск. Быў членам літаб’яднання «Маладняк» (да 1926), потым «Узвышша». Працаваў інструктарам Цэнтральнага бюро краязнаўства пры Інбелкульце."
    },
    {
      "date": "1926 - 1930",
      "text": "Скончыў літаратурна-лінгвістычнае аддзяленне педагагічнага факультэта БДУ ў 1930."
    },
    {
      "date": "1932 - 1936",
      "text": "Працаваў загадчыкам аддзела ў часопісе «Полымя рэвалюцыі». "
    },
    {
      "date": "1939 - 1940",
      "text": "Удзельнічаў у паходзе Чырвонай Арміі ў Заходнюю Беларусь, у савецка-фінскай вайне (1939—1940). На пачатку Вялікай Айчыннай вайны працаваў у франтавых газетах «За Савецкую Беларусь», «Красноармейская правда»"
    },
    {
      "date": "1943 - 1945",
      "text": "Рэдагаваў сатырычную газету-плакат «Раздавім фашысцкую гадзіну»."
    },
    {
      "date": "1945 - 1947",
      "text": "Быў рэдактарам часопіса «Вожык». У 1946 у складзе дэлегацыі БССР удзельнічаў у рабоце I сесіі Генеральнай асамблеі ААН. "
    },
    {
      "date": "1947 - 1952",
      "text": "Быў загадчыкам сектара мовазнаўства Інстытута мовы і літаратуры АН БССР."
    },
    {
      "date": "1952 - 1956",
      "text": "Быў дырэктарам Інстытута мовазнаўства АН БССР."
    },
    {
      "date": "1956 - 1982",
      "text": "Быў віцэ-прэзідэнтам АН БССР."
    },
    {
      "date": "1982 - 1989",
      "text": "Быў вядучым навуковым супрацоўнікам-кансультантам у аддзеле лексікалогіі і лексікаграфіі Інстытута мовазнаўства імя Якуба Коласа АН БССР."
    },
    {
      "date": "1991",
      "text": "Памёр 7 студзеня 1991, пахаваны на Усходніх могілках Мінска."
    }
  ],
  "work": [
    {
      "title": "«Хвядос — Чырвоны нос»",
      "date": "1931"
    },
    {
      "title": "«Выбраныя вершы»",
      "date": "1935"
    },
    {
      "title": "«Вершы і байкі» ",
      "date": "1967, 1990"
    },
    {
      "title": "«Байкі і вершы»",
      "date": "1971"
    }
  ]
}