{
  "name": "Кондрат Крапива (настоящее имя — Кондрат Кондратович Атрахович)",
  "date": "22 февраля(5 марта) 1896 - 7 января 1991",
  "img": "krapiva.jpg",
  "videoId": "GNAg_RsitF0",
  "vita": "Белорусский советский писатель, поэт, драматург и переводчик, литературовед, сатирик, общественный деятель. Доктор филологических наук, академик АН Белорусской ССР (1950). Член ВКП(б) с 1941 года. Народный писатель Белорусской ССР (1956). Герой Социалистического Труда (1975). Лауреат двух Сталинских премий (1941, 1951) и Государственной премии СССР (1971).",
  "lng": "ru",
  "birthPlace": "д. Низок, Минский уезд, Минская губерния, Российская империя",
  "timelineData": [
    {
      "date": "1896",
      "text": "Родился 22 февраля (5 марта) 1896 год в деревне Низок (ныне Узденский район Минской области Республики Беларусь) в крестьянской семье. Отец — Кондрат Михайлович. Мать — Пелагея Даниловна. Учился в церковно-приходской школе в родной деревне, Узденском народном училище, 4х-классовом городском училище города Столбцы, из которого перевёлся в училище Койданово (теперь Держинск)."
    },
    {
      "date": "1913",
      "text": "Экстерном сдал экзамен на звание народного учителя."
    },
    {
      "date": "1914",
      "text": "Осенью получил место учителя в деревне Мнишаны Минской губернии. Проработав год, был мобилизован в армию."
    },
    {
      "date": "1916",
      "text": "В марте окончил Гатчинскую школу прапорщиков. Воевал на Румынском фронте."
    },
    {
      "date": "1918",
      "text": "Был демобилизован в феврале. Учительствовал в деревне Каменка на Узденщине."
    },
    {
      "date": "1920 - 1923",
      "text": "Служил в РККА."
    },
    {
      "date": "1924 - 1925",
      "text": "Работал учителем начальной школы в посёлке Островок на Узденщине."
    },
    {
      "date": "1925 - 1926",
      "text": "В 1925 году переехал в Минск. Был членом литературного объединения «Маладняк» (до 1926), потом «Узвышша». Работал инструктором Центрального бюро краеведения при Инбелкульте."
    },
    {
      "date": "1926 - 1930",
      "text": "Учился на литературно-лингвистическом отделении педагогического факультета БГУ."
    },
    {
      "date": "1932 - 1936",
      "text": "Был заведующим отдела в литературном журнале «Пламя революции» (белор. «Полымя рэвалюцыі»)."
    },
    {
      "date": "1939 - 1940",
      "text": "В 1939 году участвовал в Польском походе РККА. Участник советско-финской войны 1939—1940 годов. В начале Великой Отечественной войны работал во фронтовой газете «За Советскую Беларусь», «Красноармейская правда»."
    },
    {
      "date": "1943 - 1945",
      "text": "Редактировал сатирическую газету-плакат «Раздавим фашистскую гадину»."
    },
    {
      "date": "1945 - 1947",
      "text": "Был редактором журнала «Вожык». В 1946 году в составе делегации БССР участвовал в работе I-й сессии Генеральной Ассамблеи ООН."
    },
    {
      "date": "1947 - 1952",
      "text": "Был заведующим сектором языкознания Института языка и литературы Академии наук БССР."
    },
    {
      "date": "1952 - 1956",
      "text": "Был директором Института языкознания АН БССР."
    },
    {
      "date": "1956 - 1982",
      "text": "Был вице-президентом АН БССР."
    },
    {
      "date": "1982 - 1989",
      "text": "Был ведущим научным сотрудником-консультантом в отделе лексикологии и лексикографии Института языкознания имени Якуба Коласа АН БССР."
    },
    {
      "date": "1991",
      "text": "Умер 7 января 1991 года. Похоронен в Минске на Восточном (Московском) кладбище."
    }
  ],
  "work": [
    {
      "title": "«Федос — Красный нос»",
      "date": "1931"
    },
    {
      "title": "«Избранные стихи»",
      "date": "1935"
    },
    {
      "title": "«Стихи и басни»",
      "date": "1967, 1990"
    },
    {
      "title": "«Басни и стихи»",
      "date": "1971"
    }
  ]
}