{
  "name": "Kondrat Krapiva (real name - Atrahovich Kondrat)",
  "date": "February 22 (March 5), 1896 - January 7, 1991",
  "img": "krapiva.jpg",
  "videoId": "GNAg_RsitF0",
  "vita": "Belarusian Soviet writer, poet, playwright and translator, literary critic, satirist, social activist. Doctor of Philology, Academician of the Academy of Sciences of the Belorussian SSR (1950). Member of the AUCP(b) since 1941. National Writer of the Belorussian SSR (1956). Hero of Socialist Labor (1975). Winner of two Stalin Prizes (1941, 1951) and the USSR State Prize (1971).",
  "lng": "en",
  "birthPlace": "Nizok village, Minsk county, Minsk Governorate, Russian Empire",
  "timelineData": [
    {
      "date": "1896",
      "text": "He was born on February 22 (March 5) in 1896 in the village of Nizоk (now Uzda district, Minsk region of the Republic of Belarus) in a peasant family. Father - Kondrat Mikhailovich. Mother - Pelageya Danilovna. He studied at the parish school in his native village, Uzda Folk School, 4-class city school of the city of Stolbtsy, from which he moved to the Koydanovo School (now Derzhinsk)."
    },
    {
      "date": "1913",
      "text": "Externally passed the exam for the title of national teacher. "
    },
    {
      "date": "1914",
      "text": "In the fall, he got a job as a teacher in the village of Mnishany, Minsk province. After working for a year, he was mobilized into the army."
    },
    {
      "date": "1916",
      "text": "In March he graduated from the Gatchina school of ensigns. He fought on the Romanian front."
    },
    {
      "date": "1918",
      "text": "He was demobilized in February. Worked as the teacher in the village of Kamenka in Uzda."
    },
    {
      "date": "1920 - 1923",
      "text": "He served in the Red Army."
    },
    {
      "date": "1924 - 1925",
      "text": "He worked as an elementary school teacher in the village of Ostrovok in Uzda."
    },
    {
      "date": "1925 - 1926",
      "text": "In 1925 he moved to Minsk. He was a member of the literary association «Maladnyak» (until 1926), then «Uzvyshsha». He worked as an instructor at the Central Bureau of Local History at Inbelkult."
    },
    {
      "date": "1926 - 1930",
      "text": "He studied at the literary-linguistic department of the pedagogical faculty of BSU."
    },
    {
      "date": "1932 - 1936",
      "text": "He was head of the department in the literary magazine «The Flame of the Revolution»."
    },
    {
      "date": "1939 - 1940",
      "text": "In 1939 he participated in the Polish campaign of the Red Army. Member of the Soviet-Finnish war of 1939-1940. At the beginning of the Great Patriotic War, he worked in the front-line newspaper «For Soviet Belarus», «Krasnoarmeyskaya Pravda»."
    },
    {
      "date": "1943 - 1945",
      "text": "Edited a satirical newspaper poster «Smash the fascist skunk»."
    },
    {
      "date": "1945 - 1947",
      "text": "He was the editor of the magazine «Hedgehog». In 1946, as part of the delegation of the BSSR, participated in the I-th session of the UN General Assembly."
    },
    {
      "date": "1947 - 1952",
      "text": "He was the head of sector of the Institute of Linguistics, Language and Literature of the Academy of Sciences of the Belorussian SSR."
    },
    {
      "date": "1952 - 1956",
      "text": "He was the director of the Institute of Linguistics of the Academy of Sciences of the USSR."
    },
    {
      "date": "1956 - 1982",
      "text": "He was the vice-president of the Academy of Sciences of the Belorussian SSR."
    },
    {
      "date": "1982 - 1989",
      "text": "He was the leading researcher and consultant in the department of lexicology and lexicography Institute of Linguistics named after Yakub Kolas of Belorussian Academy of Sciences."
    },
    {
      "date": "1991",
      "text": "He died on January 7, 1991. Buried in Minsk on the Eastern (Moscow) cemetery."
    }
  ],
  "work": [
    {
      "title": "«Fedos — Red nose»",
      "date": "1931"
    },
    {
      "title": "«Selected poems»",
      "date": "1935"
    },
    {
      "title": "«Poems and fables»",
      "date": "1967, 1990"
    },
    {
      "title": "«Fables and poems»",
      "date": "1971"
    }
  ]
}